<template>
  <div id="intro">
    <img class="nav-bg" src="~assets/img/bg/intro-bg.jpg" alt="/" />
    <div class="bg">
      <div class="main">
        <el-tabs tab-position="left" class="windows">
          <el-tab-pane label="公司简介"
            ><div class="article">
              <h1 class="title">标题</h1>
              1演示数据演示数1999演，演示数据演示数据演示数据演示。演示“演示数据演示数据”演示数，演示“演示数据，演示数据演示数据演”演示数，演示数“演示数”演示数据演示数据演示数据演示数据演示数，演示数据演示100演示数据演示数据演示数据，演示数据演示数据演示数据演，演示数据演示数据演示数据演示数据演示、演示数据、演示数据演示数。演示，演示数据演、演示数据演示数据演示数据演示数据演示数据演示数据演示数、演示数据演示数据演。演示数“演示数据、演示数据、演示数据、演示数据、演示数据”演示数据演示数，演示数据演示、演示数据，演示数据演示数据演示数据，演示数据演示数据演示。
              演示数据演示数据演示数据演示数据演示数据演示数据演示数据演示数据演示数据演，演示数据演示数（演示数据）演示数据演、演示数据演，演示数据演示数据演示数据演示数据演示数据演示数据演示数据，
              演示数据演示数据演示数据演、演示数据演、
              演示数据演示数据演示数据演，演示数据演示数据演示数据演示数据演示数据演示数、演示数据演示数据演，演示数据演示数据演示数据演示数据演示数据演示数据演示数据演示数据、演示数据演示数据演，演示数据演示数、演示数据演示数据，演示数据演示数据演。演示，演示数据演示数据“演示数”“演示数据演示数据演示数据演示数据演”演示数据演示。
            </div></el-tab-pane
          >
          <el-tab-pane label="技术介绍">
            <div class="article">
              <h1 class="title">标题</h1>
              2演示数据演示数1999演，演示数据演示数据演示数据演示。演示“演示数据演示数据”演示数，演示“演示数据，演示数据演示数据演”演示数，演示数“演示数”演示数据演示数据演示数据演示数据演示数，演示数据演示100演示数据演示数据演示数据，演示数据演示数据演示数据演，演示数据演示数据演示数据演示数据演示、演示数据、演示数据演示数。演示，演示数据演、演示数据演示数据演示数据演示数据演示数据演示数据演示数、演示数据演示数据演。演示数“演示数据、演示数据、演示数据、演示数据、演示数据”演示数据演示数，演示数据演示、演示数据，演示数据演示数据演示数据，演示数据演示数据演示。
              演示数据演示数据演示数据演示数据演示数据演示数据演示数据演示数据演示数据演，演示数据演示数（演示数据）演示数据演、演示数据演，演示数据演示数据演示数据演示数据演示数据演示数据演示数据，
              演示数据演示数据演示数据演、演示数据演、
              演示数据演示数据演示数据演，演示数据演示数据演示数据演示数据演示数据演示数、演示数据演示数据演，演示数据演示数据演示数据演示数据演示数据演示数据演示数据演示数据、演示数据演示数据演，演示数据演示数、演示数据演示数据，演示数据演示数据演。演示，演示数据演示数据“演示数”“演示数据演示数据演示数据演示数据演”演示数据演示。
            </div>
          </el-tab-pane>
          <el-tab-pane label="未来展望"
            ><div class="article">
              <h1 class="title">标题</h1>
              3演示数据演示数1999演，演示数据演示数据演示数据演示。演示“演示数据演示数据”演示数，演示“演示数据，演示数据演示数据演”演示数，演示数“演示数”演示数据演示数据演示数据演示数据演示数，演示数据演示100演示数据演示数据演示数据，演示数据演示数据演示数据演，演示数据演示数据演示数据演示数据演示、演示数据、演示数据演示数。演示，演示数据演、演示数据演示数据演示数据演示数据演示数据演示数据演示数、演示数据演示数据演。演示数“演示数据、演示数据、演示数据、演示数据、演示数据”演示数据演示数，演示数据演示、演示数据，演示数据演示数据演示数据，演示数据演示数据演示。
              演示数据演示数据演示数据演示数据演示数据演示数据演示数据演示数据演示数据演，演示数据演示数（演示数据）演示数据演、演示数据演，演示数据演示数据演示数据演示数据演示数据演示数据演示数据，
              演示数据演示数据演示数据演、演示数据演、
              演示数据演示数据演示数据演，演示数据演示数据演示数据演示数据演示数据演示数、演示数据演示数据演，演示数据演示数据演示数据演示数据演示数据演示数据演示数据演示数据、演示数据演示数据演，演示数据演示数、演示数据演示数据，演示数据演示数据演。演示，演示数据演示数据“演示数”“演示数据演示数据演示数据演示数据演”演示数据演示。
            </div>
          </el-tab-pane>
          <el-tab-pane label="联系我们"
            ><div class="article">
              <h1 class="title">标题</h1>
              4演示数据演示数1999演，演示数据演示数据演示数据演示。演示“演示数据演示数据”演示数，演示“演示数据，演示数据演示数据演”演示数，演示数“演示数”演示数据演示数据演示数据演示数据演示数，演示数据演示100演示数据演示数据演示数据，演示数据演示数据演示数据演，演示数据演示数据演示数据演示数据演示、演示数据、演示数据演示数。演示，演示数据演、演示数据演示数据演示数据演示数据演示数据演示数据演示数、演示数据演示数据演。演示数“演示数据、演示数据、演示数据、演示数据、演示数据”演示数据演示数，演示数据演示、演示数据，演示数据演示数据演示数据，演示数据演示数据演示。
              演示数据演示数据演示数据演示数据演示数据演示数据演示数据演示数据演示数据演，演示数据演示数（演示数据）演示数据演、演示数据演，演示数据演示数据演示数据演示数据演示数据演示数据演示数据，
              演示数据演示数据演示数据演、演示数据演、
              演示数据演示数据演示数据演，演示数据演示数据演示数据演示数据演示数据演示数、演示数据演示数据演，演示数据演示数据演示数据演示数据演示数据演示数据演示数据演示数据、演示数据演示数据演，演示数据演示数、演示数据演示数据，演示数据演示数据演。演示，演示数据演示数据“演示数”“演示数据演示数据演示数据演示数据演”演示数据演示。
            </div>
          </el-tab-pane>
        </el-tabs>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: "Intro"
};
</script>

<style scoped>
#intro {
  min-height: 500px;
}

.nav-bg {
  width: 100%;
  min-width: 1200px;
  height: 200px;
}

.bg {
  background: -webkit-linear-gradient(top, white, lightblue, white);
}

.main {
  /* background: gray; */
  width: 70%;
  min-width: 1200px;
  margin-left: auto;
  margin-right: auto;
  min-height: 800px;
}

.windows {
  margin-top: 100px;
  min-height: 200px;
  width: 80%;
  margin-left: auto;
  margin-right: auto;
}

.article {
  margin-left: 100px;
  line-height: 30px;
}
</style>
